import React from 'react'

const About = () => {
   const productLists = [
      'ระบบ ERP (มีโมดูล ให้เลือกตามความต้องการ) รวมไปถึงสามารถออกแบบ/ปรับแต่ง (Customize) ในบางฟังก์ชันงาน ให้ตรงกับความต้องการของลูกค้า',
      'ระบบจัดการคิว (IDEV-Q)',
      'ระบบจัดการซื้อขายหน้าร้าน (E-POS)',
      'ระบบจัดการคลินิก (CLINIC-PRO) สามารถออกแบบ/ปรับแต่ง (Customize) ฟังก์ชันงาน ให้ตรงกับความต้องการและประเภทธุรกิจของลูกค้า',
      'ระบบจัดการถ่ายภาพ (E-PHOTO) สามารถเชื่อมต่อฟังก์ชันงานในธุรกิจของลูกค้าได้',
   ]

   const TypographyList = ({ detail }) => {
      return (
         <ul className='my-2 ml-4 list-disc [&>li]:mt-2'>
            <li>{detail}</li>
         </ul>
      )
   }
   return (
      <div className='max-w-screen-xl px-4 mx-auto mt-20 pt-14 md:px-6 lg:px-8'>
         <div>
            <h1 className='mb-4 text-2xl font-semibold'>About IDEV Agency</h1>
            <p className='mb-6'>
               IDEVFLOW (ไอ เดฟ โฟลว์)
               ก่อตั้งขึ้นด้วยความมุ่งมันที่จะพัฒนาผลิตภัณฑ์ดิจิตอลและโซลูชั่นด้านเทคโนโลยี
               เพื่อตอบสนองความต้องการของผู้ใช้งานได้อย่างมีประสิทธิภาพ
               และเป็นศูนย์การเรียนรู้ด้านนวัตกรรมดิจิทัลและเทคโนโลยีให้กับองค์กรและบุคคลทั่วไป
            </p>
            <h2 className='text-lg font-semibold'>ผลิตภัณฑ์และบริการของเรา</h2>
            {productLists.map((productList, index) => (
               <TypographyList key={index} detail={productList} />
            ))}
         </div>
         <div className='mt-8'>
            <h1 className='mb-6 text-2xl font-semibold'>
               ด้านการพัฒนาซอฟต์แวร์ หรือพัฒนาระบบตามขอบเขตโครงการที่มีสัญญาการจ้าง (Project
               development)นอกจากนี้ยังมีบริการให้คำปรึกษา ดูและระบบ
               การพัฒนาซอฟต์แวร์ตามความต้องการของลูกค้า (Outsourcing/ Managed services)
            </h1>
            <p className='mb-4'>
               Innovation Development & Community (IDEV-KORAT) จัดตั้งขึ้นในจังหวัดนครราชสีมา
               เป็นศูนย์การเรียนรู้ การอบรมด้านนวัตกรรมดิจิทัลและเทคโนโลยี
               การออกแบบระบบและพัฒนาซอฟท์แวร์ ทั้งเป็นแหล่งสนับสนุนด้านการศึกษา (Academy program)
               สำหรับกลุ่มผู้สนใจ และจะเป็นการสร้างโอกาสในการทำงานในอนาคต มีการแลกเปลี่ยนความรู้
               (Community) กับผู้ที่มีประสบการณ์ในสายงานต่างๆ
               รวมไปถึงจัดกิจกรรมที่จะช่วยให้เกิดการรวมกลุ่ม
               ร่วมส่งเสริมให้เกิดตลาดแรงงานของคนรุ่นใหม่ในภูมิภาค
               รวมไปถึงกระตุ้นให้เกิดการประยุกต์ใช้เทคโนโลยีสมัยใหม่
               พร้อมยกระดับธุรกิจให้สามารถแข่งขันและเติบโตได้อย่างยั่งยืน
            </p>
            <p className='mb-4'>
               Partner strategies บริษัทมีเป้าหมายในการสร้างมูลค่าของบริษัทและบริษัทคู่ค้า
               ผู้เชี่ยวชาญที่เกี่ยวข้อง (Specialized Developer) ด้วยนวัตกรรมที่พัฒนาขึ้นร่วมกัน
               (Under contract / MOU) ที่สามารถแข่งขัน มีความแตกต่าง (Differentiate)
               และตอบโจทย์การให้บริการแก่ลูกค้า (Expectation & Requirements)
            </p>
         </div>
      </div>
   )
}

export default About
